package grechhub.cc.ua

import android.location.Location
import grechhub.cc.ua.data.Achievement


object AchivementInVilege {

    fun checkAchievements(locationtemp: Location):List<Achievement>
    {
        val listAchievement: MutableList<Achievement> = mutableListOf()

        listAchievement.addAll(checkGrechPody(locationtemp))
        listAchievement.addAll(checkKrasnoiPod(locationtemp))
        listAchievement.addAll(checkSvistunove(locationtemp))
        listAchievement.addAll(checkMirol(locationtemp))
        listAchievement.addAll(checkStepove(locationtemp))
        listAchievement.addAll(checkKravci(locationtemp))
        listAchievement.addAll(checkPologu(locationtemp))
        listAchievement.addAll(checkNewLife(locationtemp))
        listAchievement.addAll(checkOlecsandrivka(locationtemp))
        listAchievement.addAll(checkPodove(locationtemp))
        listAchievement.addAll(checkKrazove(locationtemp))
        listAchievement.addAll(checkVodane(locationtemp))
        listAchievement.addAll(checkOzerne(locationtemp))//мало инфо
        listAchievement.addAll(checkKalunivka(locationtemp))//мало инфо
        listAchievement.addAll(checkTrud(locationtemp))//мало инфо

        return listAchievement.toList()
    }

    fun checkGrechPody(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Гречані Поди",
            R.drawable.achivement_villege,
            R.drawable.villege_grechpodu,
            "Найстарішими поселеннями в сільській раді є села Свистуново та Мар'їнфельд, або Підгорне. Мар'їнфельд в перекладі з німецького Мар'їна земля, було німецьким поселенням, воно поступово зникло, а жителі переселились в с. Свистунові. Перші хати в селі Свистуново за однією з версій були збудовані в 1894 році німецькими поселенцями. Нащадки цих переселенців заснували в 1915 році нове поселення - село Роза Люксембург (нині Гречані Поди)  (Колишня німецька колонія Ней-Лібенталь).\nТут же розташована і центральна садиба колективного сільськогосподарського підприємства «Калинівський».(1997р)\nГордістю КСП «Калинівський» є конеферма. Багато зусиль для відродження конярства доклав Микола Іванович Якимюк. Тепер радгосп має право брати участь у виставках, аукціонах, продавати коней.У 1951 році завезли 2 кобили угорсько-пруської породи з криничанського району і почалася підготовка до початку племінної справи.\nЯкщо згадати нашу історію аж до часів Січі, то на користь калинівцям буде твердження,   що   наші   предки,   легендарні   козаки-запорожці, вважалися неперевершеними майстрами верхової їзди і вважали коня мало не святим створінням.\nКрім української верхової породи, є англійська, орловська, торійська. Один з ентузіастів конярства Олександр Дзятко похвалився, що за жеребця Хусейна на всеукраїнській сільгоспвиставці в м. Дніпропетровську пропонували автомобіль «Вольво». Жеребець Цілиноград брав участь у змаганнях різних видів в СНГ (Москва, Дніпропетровськ).\n(Джерело: Широківщина В.Ганенко, Л.Бай) "

        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.791670;    val longlatitudeUpLeft =33.454218
        val latitudeDownRight =47.779857;  val longlatitudeDownRight =33.473654
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownRight/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownRight/*нижний правый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkKrasnoiPod(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Красний Під",
            R.drawable.achivement_villege,
            R.drawable.villege_krasnoipid,
            "В селі Красний Під проживало багато євреїв. Була ще й єврейська колонія Лекерта, яка раніше була центром сільської ради. В селі 1924 року збудовано школу. У 1937 р. тут відкрилась єврейська школа, яка після розкуркулювання заможних євреїв закрилася.\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.762401;    val longlatitudeUpLeft =33.443175
        val latitudeDownLeft =47.756402;  val longlatitudeDownLeft =33.466940
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkSvistunove(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Свистунове",
            R.drawable.achivement_villege,
            R.drawable.villege_svistunivo,
            "Протягом останньої чверті ХУШ ст. адміністративно-територіальний поділ Південної України зазнав неодноразових змін. Утворювались губернії, які пізніше реорганізовувались у намісництва. Нарешті, відповідно до Указу Павла І від 1796 року, замість Катеринославського та Вознесенського намісництв і Таврійської області\n" +
                    "була організована Новоросійська губернія.\n" +
                    "З кінця ХУШ століття безмежні степи Північного Причорномор'я почали швидко заселятись. На нові землі прибули втікачі від соціального гніту з Правобережної та Лівобережної України, центральних губерній Росії. В південну Україну прибуло також чимало іноземних колоністів: сербів, болгар, молдован, німців.\n" +
                    "Під час семирічної війни граф Румянцев звернув свою увагу на взірцеві господарства меннонітів, німців, лютеранів. Перше поселення німців було в районі впадання в Дніпро р. Мокра Сура. Саме в цей період - кінець ХУШ століття - з'явились перші німці-переселенці на території нашого сучасного Широківського району. Тоді ж виникають села Свистуново і Мар'їнфельд. Таким чином, датою їх заснування слід вважати 1798 рік.\n" +
                    "Німці принесли культуру землеробства. Почали культивувати нові сільськогосподарські високоврожайні культури, завезли високопродуктивну худобу, запровадили західноєвропейську культуру будівництва населених пунктів. Якщо до цього сільська будівля була глинобитною, то з переселенням німців на західній околиці с. Свистуново була побудована цегельня, де випалювалась цегла і черепиця, які йшли на будівництво сіл. Німецькі майстри, крім різноманітних глиняних виробів, вміли виготовляти керамічні домовини, на які мешканці села зараз\n" +
                    "натрапляють під час поховань.\n" +
                    "Відведені землі належали трьом німецьким землевласникам, які жили в Свистуново і мали розкішні приватні садиби, поряд яких розташовувались більш скромні будівлі мешканців, які наймитували у багатих.\n" +
                    "Мар'їнфельд було засновано як допоміжний населений пункт, в якому проживали люди, що служили землевласникам із Свистуново. Перший ставок, на березі якого стояв Мар'їнфельд, сягає своєю історією в сиву давнину. У ті далекі часи він слугував місцем відпочинку, навколо нього були розташовані загони для худоби і птахів, власниками яких були свистунівські господарі. Обабіч буяли зелені насадження та пасовиська з сокови¬тими багаторічними травами. Сіна тут було настільки багато, що заготовленням його займалися за невелику\n" +
                    "платню мешканці села Широкого.\n" +
                    "Мар'їнфельд, а особливо Свистуново, мали привабливий вигляд. З кінця в кінець вулиці проходив високий суцільний цегельний мурок через усе село з напівовальними арками-воротами на в'їздах до дворів. На кожній садибі красувались цегляні будинки, кожен господар мав величезних розмірів кам'яні погреби з куполоподібними\n" +
                    "зводами.\n" +
                    "Під час революції (1917 рік) та наступного безвладдя Свистуново та Мар'їнфельд піддавалися жорстоким\n" +
                    "пограбуванням банд з Широкого.\n" +
                    "В 1920 році із 9 волостей Верхньодніпровського повіту і частини повітів Миколаївської губернії: Олександрівського, Єлисаветградського і Херсонського утворюється новий повіт - Криворізький.\n" +
                    "В 1923 році центральна адміністративно-територіальна комісія ВЦВК 13 лютого затвердила новий адміністративно-територіальний поділ, за яким Катеринославська губернія реорганізована в 7 округів. (Повіт\n" +
                    "стає Криворізьким округом).\n" +
                    "Жителі села в короткий час справились з післяреволюційною розрухою і вже за переписом населення в 1925 році до складу Олександрівської сільської ради (село Олександрівка до 1917 року називалось Новоолександрів-кою) входить 8 населених пунктів, в тому числі село Свистуново.\n" +
                    "До самої війни Свистуново і Мар'їнфельд розквітали і основними4 жителями були німці. Жили вони і під час окупації аж до наближення фронту, а потім примусово виїхали разом з відступаючими німецькими військами.\n" +
                    "Під час наступу наших військ (в лютому 1944 року) с. Мар'їнфельд дуже постраждало, командуванню змушене було застосувати ракетні установки «Катюша», поскільки в населеному пункті знаходилось сильне угрупування ворога. Після війни в селі продовжували жити люди, а згодом його спіткала доля безперспективного, як і багато інших населених пунктів.\n" +
                    "В Свистуново залишились порожні будівлі, здебільшого зруйновані. В них поселились жителі із навколишніх сіл: Потороча Дмитро, Авраменко Дмитро, Соболева Олександра, Шешко Василь, Мущенко Лазар, Кисильов Тарас та інші (1944 p.), а в 1945 році приїхали сім'ї депортованих українців з колишніх польських земель. Це -Климюки, Дзятки, Дашки, Іванчуки, Колесники, Войцики, Харчуки... В 1952 році приїхали переселенці з Західної України. їх розселяли по квартирах, а згодом з допомогою колгоспу вони побудували свої будівлі. На місці\n" +
                    "старих зруйнованих хат піднімались нові гарні будинки. До 1950 року село Свистуново було окремим колгоспом імені К. Лібкнехта. Першим головою колгоспу був Авраменко Дмитро Гнатович, після нього невеликий проміжок v часу колгоспом керував Сакович (з Подового), а потім - відданий своїй справі Горб Яків Іларіонович, рільником був Шешко Василь Романович.\n" +
                    "Відразу після визволення (1944 р.) колгосп мав дві корівки і десяток коней (кілька з яких підірвались на мінах, бо околиця села була замінована аж до 1946 року). Ферми створені були за рахунок приватного сектора: колгоспники добровільно віддали свою худобу. Сіяли також позиченим у людей зерном. Після збору врожаю з боргами розрахувались. Працівники не шкодували сил, ледарів не було, працювали дружно, відпочивали по кілька годин на добу. Вдень жнеш, в'яжеш снопи, вночі їх складаєш, або ж вдень молотиш, а вночі вієш ручною віялкою. Вручну навантажуєш на підводи, відправляєш на елеватор на Радушне. Це треба встигнути зробити за ніч, бо вдень чекає інша термінова робота. Спочатку землю обробляли волами і коровами. З появою стареньких тракторців ХТЗ, «Універсал» колгоспники одержали змогу швидше виконувати роботу. Контроль був скрупульозний: і вночі міг з'явитись представник району, (виміряти, наприклад, глибину оранки і, не дай Бог, виявить, що зорано менше ніж на ЗО сантиметрів...) Про крадіжки не було і мови. Та колгоспники і без такої пильноти працювали добросовісно і дбайливо виконували доручену справу. Кожен намагався зробити як можна більше, обов'язково перевиконати завдання. В період оранки працювали і вночі. Попереду йшла людина борозною і несла ліхтар, а за вогником-орієнтиром йшов трактор з одним плугом. На полі з кожного краю стояло по З діжки, Якщо спорожнювався радіатор, несли відрами доливати, інколи на відстань більше півкілометра. Молодь і люди несімейні увесь літній період були у полі. Трактори, жатки, інший реманент теж знаходився весь сезон на полях, бо дуже економили пальне і берегли механізми. Використовували їх тільки за призначенням, про холості пробіги ніхто не міг і подумати. Техніка і без того була така слаба, що доводилось ремонтувати без кінця. Ретельно виконували роботи трактористи Забело Петро, Литвин Сергій, Климюк Василь, причеплювачі Міщук Надія, Цибулько Клавдія. Збігати з поля по мастило, запчастини (а село за 3-4 кілометри), поки трактор ремонтується, не вважала за проблему 19-річна Настя Шешко. Пальне підвозив Ільченко Кирило. На літньому стані готувала смачні обіди і пекла запашний хліб Шешко Марфа Іванівна.\n" +
                    "Поступово добробут трудівників зростав. В селі з'явився корівник, де господарювала Горвазюк Явдокія і її сестри Катя і Надя. Вони не тільки доїли корів, а й підвозили корм, напували худобу (воду діставали цебром з колодязя, а в зимовий період до цього треба було зусиль докласти нелюдських), чистили ферми. Доглядали свиней на свинофермі Жукова Марія, Рева Фрося. Конюхами були Дзятко Феофіл та Климюк Йосип. Якщо на кожній з цих ферм було до 20 тварин, то у вівчарні овець мали кілька тисяч. І випасав, і стриг їх Яків Гаврилюк зі своєю сім'єю. План по здачі вовни і м'яса виконувався. На птахофермі було близько 3 тисяч птахів. Біля них клопотались мати і дочка Ольшевські Катерина і Фрося, пізніше Петриченко Катерина. Майстрами на всі руки можна назвати Поторочу Дмитра, Дзятка Сергія. Рільницькі ланки в своєму складі налічували більше 20 молодих сильних старанних дівчат. Женя Григоренко, Галя Кисильова, Женя Климюк, Надя Короконда, Мущенко Тоня і Ліда.\n" +
                    "Були взірцеві поля: ні грудочки, ні бур'янцю - «Хоч каші кинь». Можна було босими ногами бігти з краю в край і не пораниш, і не вколеш, земля, як пух. А тому й пшениця зерно в зерно, качани кукурудзи як на підбір. ї ячмінь, і жито, і просо... Мав колгосп і кузню, пишався справжнім майстром - ковалем Устиновим О.С., а молотобойцем вправним був Шешко Іван. Відбудували цегельню, яка справно давала цеглу і черепицю не тільки для своїх потреб, а й виконувала замовлення інших господарств. Шевченко - досвідчений, літній вже чоловік - гончарував тут. Випалювався і череп'яний посуд, який бричкою возили на базар до міста.\n" +
                    "Оплата праці була натуральною. Частину заробленого віддавали облігаціями - на 20 років державна позика. Іншу частину після збирання врожаю - зерном, на зароблений тру¬додень - від 200 грамів до 2 кілограмів зерна. Старанний працівник міг за рік виробляти до 700 трудоднів. Грошима не одержували нічого. Щоб щось купити, продавали зерно чи якусь живність (колгоспники тримали худобу - свиней, овець, гусей, курей). V В 1950 році Свистуново приєднали до колгоспу імені Дзержинського (с. Рози Люксембург). Головами колгоспу були Дрига, Малевич, Сіпаренко.\n" +
                    "Укрупнення господарств негативно відбилося на продуктивності землеробства і тваринництва. До цього колгоспники були істинними господарями і конкретно бачили плоди своєї праці. Дбайливо доглядався кожен клаптик землі, з якого отримували максимальну І віддачу. Кожна тварина, старанно нагодована, була високопродуктивною. Прискіпливо вівся облік одержаної продукції, збут якої здійснювався колективно. У 1960 році землі села Свистуново були об'єднані з Миролюбівкою, центральною садибою стало село Миролюбівка. Саме в ці роки була побудована недосконала зрошувальна система\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.791539;    val longlatitudeUpLeft =33.402441
        val latitudeDownLeft =47.783149;  val longlatitudeDownLeft =33.422505
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkMirol(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Миролюбівка",
            R.drawable.achivement_villege,
            R.drawable.villege_mirol,
            "На південному сході від Кривого Рогу розташоване село Миролюбівка. Колись це були цілинні чудові\n" +
                    "чорноземні степи, порізані великими балками Велика Кроква і Мала Кроква. У XIX столітті  землі, які пролягали\n" +
                    "від села Войкове до селища Радущного і нараховували 6 тисяч десятин, були привласнені чиновником з міста\n" +
                    "Херсона Яновським. Така ж кількість землі Яновського була і в Бесарабії, яку він подарував своєму зятеві.\n" +
                    "Керував своїм господарством Яновський наїздами з Херсона, де він займав високу посаду, а конкретним\n" +
                    ". господарем на землі був управитель.\n" +
                    "Напрямок господарства - тваринницький. Сільськогосподарські культури вирощувались в основному для потреб тваринництва. Культивувалися високопородні вівці, яких було десятки тисяч голів. Ще й зараз можна по залишках будівельних матеріалів між садами Свистуново і Миролюбівка окреслити кордони панської економії, де були розташовані господарські будівлі, кошари для овець та бараки для наймитів.\n" +
                    "Після революції 1917 року деякий час ці землі були без певного господаря, тому використовувались криворізькими шахтарями під городи. Деякі криворіжці почали будувати землянки і залишались на круглий рік на цій землі.\n" +
                    "Після голодного 1922 року почали переселятись білоруси з Могильовської і Мінської областей. У 1923 році білорусами-переселенцями та криворізькими шахтарями було засновано село. Поскільки приїжджий люд був мирним і трудолюбивим, тому і село нарекли Миролюбівкою.\n" +
                    "Перші переселенці білоруси: Верщки, Івановські, Короленки, Поташі, Шарки, Демошкевичі. і переселенці криворізьких копалень: Смоквіни, Лавроненки, Стадники, Криштопи, Столітні, Чумаки, Архипенки, Сичі, Чумаченки. Пізніше переїхали Безпальки з Кіровоградщини, Ісаченки з Сергіївки, Підрядови, Шевченки, Білостоцькі з Олександрівки.\n" +
                    "V У 1939 році після змін, які відбулися на західному кордоні України, до села з території колишніх польських земель, були переселені родини Кеців, Норовичуків, Матиюків.\n" +
                    "У 1923 році село будувалося власними силами переселенців і мало Г-подібну форму:   центральна вулиця строго зі сходу на захід і допоміжна - з півночі на південь. Для будівництва хат використовувались глина і солома. Жителі займалися землеробством, кожна родина мала по 5-Ю десятин землі. Господарства були приватними. За короткий час були вирощені великі фруктові сади, територія села буяла декоративними насадженнями.\n" +
                    "У 1930 році було створено колгосп, який очолив Лука Іванович Козак. Його послідовниками були Олександр Олександрович Кушнір, Сушко з села Лозуватки, Кривошеєв, Забело Володимир Микитович, Вербенець Борис Семенович, Горбач Веремій Сергійович, Вовченко Микола Васильович - Герой Соціалістичної Праці, Пуга Всеволод Пантелійович, Крейса Михайло Акимович, Андрух Василь Миколайович, Козаченко Микола Васильович.\n" +
                    "І вже в 1935 році в господарстві налічувалось 800 га землі, 85 коней, 25 корів, 120 свиней, 150 голів овець. В цьому ж році було закладено на східній околиці села сад на 100 га, який очолив Павло Савелійович Івановський. Посадковий матеріал вирощували у власному розсаднику.\n" +
                    "Люди повірили в нову систему господарювання і працювали не покладаючи рук. Жили дружно, весело, косили жатками, жали серпами, вручну в'язали снопи. Першими будівничими колгоспу були: П. Т.Безпалько (брига¬дир), Ф. Короленко, Г. Д. Дерев'янко (делегат II Всесоюзного з'їзду колгоспників-ударників, яка все життя гордилася зустріччю з Калініним та червоною косинкою, яку подарувала їй Надія Костянтинівна Крупська), Вершок М., Вершок.Є., Вершок Ю., Вершок А., Івановський Я. (кавалер ордена Леніна), Івановський С, Івановський П., Івановська О. та інші.\n" +
                    "До початку Великої Вітчизняної війни артіль імені Сталіна набула значного економічного розвитку. Були побудовані свиноферма, конюшня, корівник, млин, баня, контора, клуб.\n" +
                    "Під час окупації жителі села працювали у господарстві. Мешканцям села жилося сутужно у фашистській неволі, але їх існування було пом'якшено діями коменданта окупаційного режиму Шпікермана - людини, позбавленої фашистських поглядів і переконань.\n" +
                    "Холодний світанок 18 лютого 1944 року можна вважати другим днем народження Миролюбівки. Визволення від фашизму принесли воїни 46-ї гвардійської армії генерала Глаголєва Василя Васильовича, безпосередню участь у боях за населені пункти брали воїни 48-ї гвардійської стрілецької дивізії під командуванням гвардії генерал-майора Корчикова, яка входила до складу 34 стрілецького корпусу генерала Кособуцького (пізніше Героя Радянського Союзу). Безпосередньо визволяли Миролюбівку воїни 143 гвардійського стрілецького полку під командуванням майора Берлінського.\n" +
                    "\"-\"Завдяки розумному командуванню підрозділів, село великих руйнацій не зазнало, основні сили наших військ діяли у напрямках східної та західної околиць, залишаючи противника в оточенні. Німецькі загарбники, побоюючись потрапити в полон, поспішно залишили село. Особливої жорстокості бої за Миролюбівку набули у західній частині села, оскільки ворог здійснював сильний артналіт з боку села Іванівки (територія сучасного ПГЗКа). Тільки прикриваючись бронею танків, наші воїни могли просуватися вперед.\n" +
                    "У лютому 1944 року, коли радянські війська визволили Миролюбівку, жителі дружно взялися за відбудову зруйнованого. Невдовзі до миролюбівського колгоспу приєдналася сусідня артіль імені Леніна (село Садове, яке потрапило під знесення). Разом відновлювали зруйновані війною господарства, розвивали колгоспну економіку. До праці дружно взялися ветерани, що повернулися: Абросов П.Л., Абрамчук К.Г., Архипенко В.І., Авдєєв Ф.Ф., Бойко М.К., Вершок М.М., Вербенець Б.С., Вовченко М.В., Вербенець М.С., Григоренко І.Є., Горбач B.C., Галачов Ф.А., Дакуко М.І./Дзятко М.В., Журавель П.І., Забело В.М., Ісаченко І.К., Івашко Я.С., Козак В.Л., Кольсун А.Ф., Кучин М.С., Курінчанін П.С., Коношевський Ф.С., Ковальчук Г.І., Косорук С.П., Конощук Н.І., Лисенко Л.Д., Лисенко Ю.Д., Ляшенко П.М., Мітла O.K. та інші.\n" +
                    "В 1949 році господарство очолив .недавній, весь зранений, фронтовик Вовченко Микола Васильович -людина до нестями віддана селу і людям під його керівництвом колгосп почав стрімко набувати вершин свого розвитку. Звелися нові виробничі об'єкти: свинарник, чотирирядний корівник, птахомістечко з власним інкубатором, пасіка, автогараж, дві водонапірні вежі, насаджені нові сади, виноградник на площі 130 га, ягідники, закладені парники. Велику увагу приділялось соціальному і культурному розвитку села: були зведені восьмирічна школа, Будинок культури, дитячий садок, магазин, закладено парк.\n" +
                    " Колгосп набув нечуваного економічного розвитку. Господарство не раз у післявоєнні роки завойовувало право брати участь у Всесоюзній виставці досягнень народного господарства СРСР, а в 1960 році було нагороджено дипломом І ступеня. Таких результатів змогли досягти завдяки невтомній праці голови колгоспу Вовченка Миколи Васильовича, якому було першому в області присвоєно звання Героя Соціалістичної праці, головного зоотехніка Кульбіди, головного бухгалтера Чоботаря Григорія, бригадира будівельної бригади Вербенця Миколи, мулярів Безпалька Івана, Обремського Володимира, бригадира польової бригади Проходи Данила, завідуючого свинофермою кавалера ордена Леніна Івановського Якова, пташниць Архипенко Антоніни, Івановської Марії, Вершок Марії, Вершок Єлизавети, Горбач Валентини - кавалера ордена Леніна, ланкових Шищової Ганни, Ісаченко Явдокії, Забело Олександри, Архипенко Олександри, Чумаченко Ніни та інших.\n" +
                    "Овочівництво стало однією із провідних галузей виробництва завдяки ентузіасту цієї і справи Андрухіна.\n" +
                    "Значних успіхів досягли тваринники, незважаючи на відсутність механізації виробництва. Завідуюча фермою Сазонович Ліза, доярки Задирака Марія, Малих Тетяна, Вовченко М.В, Зубова Рая, Пузик Ганна, Сич Марія, М'ядіна Віра, Рябенко Єва, Пихнівська Марія, Хомула Ганна, тваринник Пав лік Федір, Заболоцька.\n" +
                    "Тракторну бригаду очолив Мисник Олексій Пантелійович. Основний внесок в розвиток господарства зробили механізатори Забело Федір, Архипенко Василь, Короленко Павло, Кучин Микола, Шульга Володимир, Литвин Володимир, Кец Павло, водії Ляшенко Павло, Горбач Веремій, Унгурян Олексій, Сич Микола, Онищенко Михайло, Столітній Олександр, Смульський Мар'ян, ковалі Шишов Дмитро, Ницько Григорій, Чумак Григорій, Колячонок, Авдєєв.\n" +
                    "У 1960 році відбулася реорганізація колгоспів, в результаті якої землі Миролюбівки і Свистуново були об'єднані в одне господарство. З 1961 року колгосп очолив Всеволод Пантелійович Пуга, який зміг утворити дієздатний керівний склад. Шломенко К. П. - головний агроном, Слюсар В. Д. - головний зоотехнік, Рябошапка М. Я. -головний бухгалтер, Мисник О. П. - головний інженер, Бойко В. С. - головний економіст. Пеліпака І. Д., Шешко І. В. - керуючі відділками, Гришальов В. Ф., Куриц І. П. - бригадири тракторних бригад, Старостенко П.С. - головний ветлікар, Лисов Є. Є. - економіст, Вербенець М. С. - бригадир будівельної бригади.\n" +
                    "До 70-х років досягли значних успіхів у виробництві. Так, в 1962-64 pp. урожайність зернових становила 41,1 центнера з гектара, вироблено м'яса 1,7 тис. цн, надій молока на фуражну корову становив 3500 літрів.\n" +
                    "Досягнені успіхи дали змогу виконати п'ятирічний план за чотири роки з такими показниками: вироблено зерна 14174 т, м'яса 755 т, молока 6528 т, яєць 3 млн. шт. За багатьма показниками хлібороби і тваринники працювали в рахунок 1971 року.\n" +
                    "З кожного гектара у 1969 році взяли найвищий в області урожай зернових. Добре вродили і соняшник, кормові культури, овочі, картопля.\n" +
                    "Держава високо оцінила роботу сільських трударів, нагородивши колгосп «Ленінською\n" +
                    "ювілейною почесною грамотою». Удостоєний почесного звання Героя Соціалістичної Праці -\n" +
                    "Гришальов Віктор Федорович. Звання заслуженого працівника сільського господарства - ».\n" +
                    "Шешко Іван Васильович, Орденами Леніна - Сич М.С., Пуга В.П., Карпенко О.Л., Косорук \n" +
                    "О.С., Шворак М.С., Шворак І.Х.\t\n" +
                    "На польовому стані тракторної бригади є добре обладнана майстерня, якою завідував бригадир Смульський Мар'ян Феліксович. Токарі Євген Озеров, Слюсар Володимир Заболоцький мали змогу швидко відремонтувати несправність у машин. А механізатори набули багатьох суміжних професій: слюсаря, токаря, зварювальника. Це Іван Скляр, Іван Бойко, Василь Попенко, Павло Логвинюк, Віктор Горбач, Шевчук Григорій, Микола Кулініч, Сич Геннадій, Яків Трохименко, Литвин Григорій та інші. Професія механізатора стала не сезонною, а постійною, високооплачуваною.\n" +
                    "Особливий нагляд за телятами племінного ядра - майбутніми високопродуктивними коровами - здійснювали тваринники Волосевич Іван, син одного з перших на Криворіжжі Героїв Радянського Союзу - Петра Семеновича Волосевича, Варвара Дзятко, Микола Архипенко, Микола Сахончик, Григорій Хомула, Олександр Бунцевич, Степан Галаша, Лідія Климук та інші.\n" +
                    "Тваринники постійно змагалися не тільки за кількість, а й за високу якість продукції. Так, 95 відсотків молока відправляли державі 1-м сортом. Доярки перейшли чотиритисячний рубіж надоїв молока на кожну фуражну корову. Це Марія Пихнівська, Єва Рябенко, Раїса Зубова, Волосевич Ганна, Горбач Катерина, М'ядіна Віра, Кулініч Марія, Куриць Марія, Боярина Валентина, Марія Піценко та інші. А очолили ферми досвідчені працівники Бунцевич Є., Піценко І., Білич П.\n" +
                    "Неподалік села розкинулась птахоферма   -  справжнє містечко з водопроводом, паровим опаленням, електрикою. Господарство це очолила Ніна Костянтинівна Кульбіда.\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)\n"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.82645;    val longlatitudeUpLeft =33.405514
        val latitudeDownLeft =47.803594;  val longlatitudeDownLeft =33.427143
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkStepove(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Степове",
            R.drawable.achivement_villege,
            R.drawable.villege_stepove,
            "Село виникло після Вітчизняної війни на території зернорадгоспу «Широківський».\n" +
                    "Історія села Степове розпочалася з 1929 року, коли на вільних землях Криворіжжя (Широківського та Апостолівського районів) був утворений Криворізький зернорадгосп, контора якого знаходилася по вулиці Поштовій (сучасна ім. Карла Маркса). Контора відділу робітничого постачання була по вул. Глінки, а база продовольчого забезпечення і пекарня - по вул. Урицького.\n" +
                    "Центральна майстерня і бараки для гуртожитків були побудовані з дерева на Мусіївськім роз'їзді. Різноробочі жили в двох'ярусних палатках. Техніка, трактори, інвентар, автомобілі були американські.\n" +
                    "Трактори гусеничні марки «Катерпілер-60, ЗО, 20». Колісні - «олівер, кейс, дерінг». Головним інженером був американець, що працював по контракту (на 2 роки), в нього перекладачкою була полячка.\n" +
                    "Утворені дві тракторні колони, яким надано по 70 гектарів землі кожній, начальниками колон були Медведєв і Манагаров.\n" +
                    "Робочий день тривав 10 годин, за відпрацьований день, як платня, видавалися талони, на які можна і одержати гроші.\n" +
                    "Робітники-неспеціалісти отримували за день 2 крб. 20 коп., тракторист - 3 крб. 20 коп. (приблизно). харчування видавалися талони на місяць. За це відраховували із зарплати 24 крб.\n" +
                    "У зв'язку з переселенням жителів із сіл Дараганове, Ізюмовка, Попівка, Андріївка по річці Боковеньк Мар'янівка, Мусіївка по річці Інгулець (в зв'язку з їх затопленням - створювалось Карачунівське водосхові у 1931 році восени центральну майстерню переведено в Довгинцеве. Побудовано із цегли майстерню, конт їдальню. Бараки - дерев'яні. В 1933 році центральну садибу було переведено в Апостолове, директором Мірошниченко, старшим механіком інженер Біляєв, начальником політвідділу -Горбачов, уповноваженим І Балика, начальником постачання Бадуля, секретарем комітету комсомолу Немичонок.\n" +
                    "Утворено три відділення, одне з них - третє - в селі Кравці.\n" +
                    "Ферма Радущанського скотозаводу почала будуватися в 1930-1931 роках біля Старого ставу, де і зараз і птахофабрики (1995 p.).\n" +
                    "Доярки спочатку жили в куренях, а сімейні - в землянках. Влітку худобу випасали, а на зиму заготовл солому, сіно. Радгосп солому не заготовляв.\n" +
                    "Влітку 1934 року ферма скотозаводу перейшла в Криворізький зернорадгосп, було укомплектовано тракторні бригади. Бригадири  Луценко, Московченко, Амосов. Так добавилось четверте відділення Криворізького зернорадгоспу. У квітні 1935 року з Криворізького зернорадгоспу виділено 3-є і 4-е відділення, знаходились на території Широківського району, і утворився Широківський зернорадгосп. Худобу було поділ на два гурти - між Криворізьким і Широківським радгоспами.\n" +
                    "Директором став Янушкевич, начальником політвідділу Наумов, старшим механіком Медведєв,  управляв Голуб А.С.\n" +
                    "Вирощували зернові культури - озиму пшеницю, жито, ячмінь, яру пшеницю, овес, просо, овочеві культу\n" +
                    "Восени 1935 року одержали потужні трактори ЧТЗ, ХТЗ —18 штук передані фермі, а решта - іншим радгосп Всі поля оброблялись під керівництвом старшого агронома Нестерова. З 1939 року директор радгоспу Шолудчев Урожай в 1941 році був багатий, та війна, що розпочалася 22 червня, порушила увесь ритм мирної праці. Близ: 40 робітників пішли на фронт, а ті, що залишились, не встигли зібрати урожай. Радгосп евакуював худобу Жданівський район Сталінградської області. Провів евакуацію і передав радгоспу худобу Голуб А.С. Техніку доручали евакуювати виконуючому обов'язки механіка Дромащці, але доправити її до місця призначення вдалося, залишилася в Донбасі, де була захоплена німцями. Радгосп як господарство існував і в часи окупації там працювала молодь з Широкого та навколишніх сіл, зібрана окупантами, під наглядом коменданта.\n" +
                    "Після визволення території району почали відбудовувати радгосп. Тваринницькі бази, гуртожиток були спал окупантами. Лише їдальня і один будинок уцілів. Ще до війни був затверджений план будівництва централь садиби на фермі. А вже після війни почали будувати перші бази, гуртожитки, житлові будинки.\n" +
                    "Після війни радгосп був прикріплений до ВРП (відділу робітничого постачання) (орсу) бурого вугілля хідних районів. Трест був у Києві, управління - у Львові. Радгосп вважався як допоміжне господарство ВРП 1947 році прикріпили до ВРП Артемвугілля (Донбас). Трест ВРП знаходився у м. Горлівці. У 1949 році знову с: зернорадгоспом тресту радгоспів, який знаходився в м. Дніпропетровську.\n" +
                    "У 1947 році перший приватний будинок побудував кузнець Усик Микита, потім поставили землянки Красу. ївановський, Ільченко, Лисечко, Пляшка і інші. По цій вулиці, що попід залізницею (колишньою), радгосп будуі двоквартирні та одноквартирні будинки, гуртожитки.(де зараз пошта). Так почалося будівництво села Степо яке спочатку в народі називалося Микитівкою.\n" +
                    "У 1952 р. почали будувати птахофабрику (Нікопольбуд), а в 1962 році радгосп перейменовано —птахофабря «Широківська».\n" +
                    "(Записано із спогадів старожила Стежка Гната Пантелійовича).\n" +
                    "У 1982 році Степове стало центром сільської ради. З 1.09.1996 року восьмирічна школа стала середньою клуб, медпункт, пошта, їдальня, стадіон.\n" +
                    "На фронтах Великої Вітчизняної війни воювало 33 чоловіки.\n" +
                    "У період визволення району лінія фронту знаходилась на території сучасної Степової сільради протягом дв тижнів. Оборону тримали воїни 41 протитанкового дивізіону, але снарядів не підвезли через бездоріжжя, то: вони не могли зупинити танки ворога, загинули всі, але не здалися ворогам. Тринадцять прізвищ загиблих відої а 37 пропали безвісти, очевидці розповідають, що їх подавили танками, тому встановити прізвища не вдало< Недалеко від барака було тяжко поранено лейтенанта Зінов'єва Валерія, його помітила молода дівчина, що проживала разом з матір'ю в бараці, Марія Іноземцева, і притягла до хати. Поранення в лейтенанта виявилося смертельним. Німці, що з'явилися тут, труп викинули в силосну яму, пізніше тіло було поховане на сільському кладовищі. Бої продовжувались до 27 лютого 1944 року.\n" +
                    "Після визволення почалося будівництво села і відродження господарства.\n" +
                    "На посіві зернових тут найкраще використовується система поливу дощувальними установками і вже не перший рік господарство має належну віддачу з поливного гектара. У цьому, насамперед, заслуга директора птахофабрики В.Ф. Тимченка. У зведеннях по району на серпень 1994 року птахофабрика «Широківська» серед кращих господарств.\n" +
                    "Мабуть, не забули степівчани і те недалеке минуле, коли механізаторів з піснями проводжали на жнивні лани. Це називалося святом стиглого колоса. Таке свято відзначалося всім селом в 1986 році.\n" +
                    "У 1971 році механізатор Станіслав Арсентійович Мороз за високий урожай кукурудзи удостоєний звання Героя Соціалістичної Праці, а також нагороджений призом Марка Озерної (приз знаходиться в районному музеї). Скажете, прикрашаєте історію святами. Але ж що було, то бул Згадаємо ще за одне свято, яке відбулося в Степовому в 1987 році, а називалося воно святом села. Напередод нього було проведено конкурс на краще подвір'я. Перше місце присуджено Михайлу Дмитровичу Ломпас\n" +
                    "його подвір'ю присвоєно звання «Двір зразкового порядку» із врученням призу - 10 курок і півня.\n" +
                    "Напередодні Нового 1987 року у селі відбулася, як вважають, знаменна на той час подія. За збільшення виробництва і заготівель сільськогосподарської продукції в особистих підсобних господарствах село нагороджено Грамотою Президії Верховної Ради УРСР. У селах Степової сільської ради найкраще здавали державі домашню тваринницьку продукцію. Лідія Петрівна Ґонтар, утримуючи в господарстві лише одну корову, здала державі майже чотири тонни молока.\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.709755;    val longlatitudeUpLeft =33.396987
        val latitudeDownLeft =47.696989;  val longlatitudeDownLeft =33.417586
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkKravci(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Кравці",
            R.drawable.achivement_villege,
            R.drawable.villege_kravci,
            "З 1920 року село Кравці заселяють вихідці з Широкого та переселенці з Кіровоградської області. Перші жителі були брати Кравці, від чого й пішла назва села. У тридцятих роках їх розкуркулили і вислали до Сибіру, де вони й померли. Будинки їх збереглися, в одному - магазин, а в другому проживає Пронський Б.А.\n" +
                    "У 1932 році утворилося третє відділення зернорадгоспу з центром у селі Кравці. У 1933 році 12 тракторів вітчизняного виробництва передані цьому відділенню.\n" +
                    "Після війни збудували школу, яку потім перевели в село Степове.\n" +
                    "Населення села працює в господарстві птахофабрики. Учні до відкриття середньої школи в с. Степове навча¬лися в Широківській середній школі № 2.\n" +
                    "У період визволення району від німецько-фашистських загарбників, лінія фронту протягом двох тижнів проходила поряд села Кравці. Механізовані частини ворога рушили на підмогу в місто Кривий Ріг. Капітану Шитову В.В. командиру першого артдивізіону (9 артилерійської дивізії генерал-майора А.І. Ратова) дано наказ зупинити ворога.\n" +
                    "У ході бою з 12 гармат лишилося 3, і до них всього 14 снарядів, боєприпасів не змогли підвезти через бездоріжжя, а ворога треба зупинити. Ворог втратив 2 танки, 7 броне¬транспортерів і близько 50 солдат. З 37 артилеристів в живих лишилося 4. Близько 100 артилеристів і піхотинців 119 гв. ст. полку пропало безвісти. Багато будинків було зруйновано. і Дорогою ціною, але ворога зупинили до прибуття підкріплення. У бою загинув капітан В.В. Шитов, якому посмертно присвоєно звання Героя Радянського Союзу. Загиблих офіцерів - Шитова, Козакевича, Захарова, Іванова перевезли в місто Апостолове і похоронили в центрі міста. Широке на той час (19 лютого) було в руках ворога.\n" +
                    "У 1994 році в с. Кравці побував колишній фельдшер (нині лікар-пенсіонер) дивізіону Шитоіва В.В. Токовий І.М., який^ще перед приїздом прислав план села та навколишньої території,\n" +
                    "відтворивши картину бою. Його розповідь і план підтвердили старожили села Панченко У. та Царенко М., які і пояснили, чому так багато воїнів пропали безвісти. їм довелося хоронити\n" +
                    "останки роздавлених ворожими танками, тому не можна було встановити їх імена.\n" +
                    "Ім'ям капітана Шитова названа головна вулиця села та поле біля села, яке доручали обробляти кращій бригаді господарства.\n" +
                    "Загиблих воїнів перезахоронили в братську могилу села Чапаєвка, їх імена викарбувано на стелах меморіалу.\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.664320;    val longlatitudeUpLeft =33.415305
        val latitudeDownLeft =47.659824;  val longlatitudeDownLeft =33.425440
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkPologu(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Пологи",
            R.drawable.achivement_villege,
            R.drawable.villege_pologu,
            "Розташоване за 15 км на схід від с. Широке і за 10 км від Олександрівки (на пд. захід). В районі с. Пологи розташовувались хутори Шрамка, Фисунова, Бобиря, Дзюби, одруби №1,2, що виникли в результаті Столипінської реформи 1907-1910 pp.\n" +
                    "Перші мешканці села були вихідцями з другої, третьої та восьмої дільниць Широкого. Було їх 38 сімей, з яких пізніше відділились діти, утворились нові сім'ї, з'явились нові хати.\n" +
                    "Пенсіонер Широкого Борис Тимофійович Заріцький у своїх спогадах до найменшої дрібниці згадує село Пологи, де він жив з самого початку виникнення поселення. А особливо детально пригадує батьківську садибу. Здається, минуле промовляє до сучасності, спонукаючи мислити, співставляти. Адже це сліди буття наших батьків, дідів і прадідів.\n" +
                    "Хата складалася з п'яти житлових кімнат і однієї для худоби (конюшні). Двері в конюшні складалися з двох горизонтальних половинок. Там були місця стоянки для коней, корови, загін для свиней, над ним поміст (сідало) для курей. На стінах - упряж, шлейки, віжки, батіг, уздечки, пута.\n" +
                    "У садибі було все, що потрібно для сільського життя. Біля хати дві груші. Одна з них «баргамота». Аж слинка покотилася, відчуваючи смак. У дворі стояла кабиця, на якій влітку варили їсти, і піч, в якій пекли хліб, сушили фрукти, гарбузи та дині, а далі, за піччю, починався сад. Багато дерев абрикос, між якими ріс хміль, а потім вишневі дерева. Перед хатою був і колодязь п'ятиметрової глибини, викладений в середині каменем. Над коло¬дязем дерев'яна цямрина з коловоротом.\n" +
                    "У дворі обов'язковим і важливим атрибутом кожного господаря була купа гною. Гній використовували для опалення і для удобрення полів та городів. Для виготовлення палива (кирпичу) залучалася вся сім'я, а інколи і сусіди. Гній розкидали, притоптували, а коли висихав, розрізали на квадрати - кирпичі.\n" +
                    "Зернові культури молотили на  току за допомогою камінних котків, перекидали   солому   на   гармані дерев'яними трійчаками, а полову - п'ятириками.   Зерно   від   полови  відділяли за допомогою віялки. Біля  току стояла клуня. Стіни її невисокі, всього до одного метра, а над ними високий    солом'яний    дах.    Тут зберігався реманент, полова, зерно, а в негоду можна було молотити хліб, квасолю, обробляти коноплі.\n" +
                    "Під двома вербами було дві ями, в яких перемішували землю або глину з соломою, заливаючи водою. Такою масою заповнювали дерев'яні форми, потім сушили і одержували будівельний матеріал - лампач, який використовували для будівництва в більшості сіл району. Як бачите, все потрібне в господарстві вироблялося своїми руками. За током садили городину. Стежка від колодязя вела до плантації малини. Понад стежкою посаджені квіти.\n" +
                    "Садиба була обсаджена з обох боків від шляху дикою акацією. Під нею проходила пішохідна доріжка вулиці. За шляхом починався присадибний шматок землі, що звався десятиною. Такі ділянки нарізалися усім переселенцям. В перші роки існування села Пологи в ньому було 33 хати і п'ять землянок, а також 16 «поперечок» типу літньої кухні. У селі нараховувалось 180 жителів. З них лише 85 можна вважати працездатними, решта діти і старики. Хоч тоді по можливості працювали майже всі. Роботи вистачало. Це видно з такої статистики. На 38 сімей припадало 65 коней і лошаків, 38 корів, 44 свиней, 19 голів овець. Було 38 бричок, 3 бідарки (на двох колесах), 27 плугів, 36 букерів, 38 борін, 20 гранітних котків, 23 полілки, 2 сіялки, 13 косарок і самоскидка, 18 віялок. З 1924 по 1941 рік у Пологах утворилося 10 нових сімей, та прибуло дві - стало 50 дворів.\n" +
                    "А помітні зміни в житті селян села Пологи, як і в інших селах, сталися в 1928-1929 роках, коли було організовано СОЗ, до якого було залучено 35 дворів. Але весною таке товариство спільного обробітку землі розпалося. Як наслідок цього в 1929-1930 роках почалося розкуркулювання. Три сім'ї були вивезені.\n" +
                    "Після цього, до кінця 1930 року колективізація вдалася. До колгоспу записалися з усіх дворів. Сільськогосподарську артіль чомусь називали «Червоний партизан». Головою колгоспу обрали К.З. Клубенка.\n" +
                    "Хати розкуркулених сімей перебудували під колгоспну контору, хату-читальню, комору, кухню, кладову, конюшню. Обладнали там і класну кімнату для школи. Парти стояли в два ряди. На одному ряді сиділи діти 1-го класу, на другому - третього. В другу зміну навчалися другий та четвертий класи. Згодом і. це минулося, і школярі до 4-го класу ходили в с. Озерне, а 5-10 класів - в с.Олександрівку, де їм наймали квартири, або жили в гуртожитку. Як не прикро, а школи в Пологах немає і понині.\n" +
                    "У 1932 році на вигоні почали будувати дворядну конюшню, посередині якої можна було проїжджати возом. Будував її Тимофій Костянтинович Заріцький. Він же будував і першу майстерню в с. Олександрівці.\n" +
                    "У Пологах назріла потреба будувати теслярню і кузню, бо ковальські та теслярські роботи виконувались у селах Влажному, Озерному, чи в Широкому. Інколи виручали цигани. У Пологах вони були частими гостями. Понапинають свої шатра на вигоні, поставлять вози-кибитки і починають майструвати. Робили сапи, лопати, вила, паяли посуд, лудили чавуни, виробляли різні металеві речі.\n" +
                    "1932-1933 pp. - голод. Багато людей пухли. Виживали, хто як міг. Ф.А. Мірошниченко здав у магазин «торгсін» свою нагороду - срібний Георгіївський хрест, яким був відзначений у першу світову війну. За срібний хрест він отримав два пуди борошна.Від голоду 12 жителів села померли.\n" +
                    "Тепер важко зрозуміти, як тоді голодні селяни копали колодязь для поливу городів глибиною до 7 метрів, а діаметром 3 метри. їздовим було легше, їх колгосп посилав з возами та кіньми на будівництво Криворізького металургійного заводу. Селяни і в інші часи брали участь на будівництві шляху Кривий Ріг -Дніпропетровськ, 25 -кілометрового «профілю» від Широкого до Олександрівки, бруківки від Широкого до заготзерна, яке було на станції Миколо-Козельськ. Так аж до 1960 року частина пологівських селян трудилась в районному шляховому відділі, відробляли так званий «гужтруд».\n" +
                    "Після 1933 року у Пологи провели телефон. Господарство придбало грузовий автомобіль ГАЗ-А, племінного жеребця «Звіробій».\n" +
                    "Почали сіяти цукровий буряк. Замахнулися навіть на каучукову рослину кок-сагиз, а також на південну рослину з бобових - арахіс. Пробували сіяти і бавовну. Як бачите, непогано починали. Проте, за чотири роки таких посівів переконалися, що ці рослини не для наших широт - не дозрівають, тому були зняті з плану.\n" +
                    "А за високі врожаї кукурудзи і виконання здачі зерна державі колгосп одержав перехідний прапор області. У вересні 1934 року з цього приводу у селі було свято. І невідомо, чи був той прапор поштовхом до подальшого розвитку господарства, але в той же рік колгоспники посадили 10 гектарів фруктового саду, а також ділянку шовковиці для розведення шовкопрядів. Тоді ж у село Пологи приїздив голова ВУЦВКу Г.ї. Петровський. І знову ж хтозна, чи допомогло це добробуту селян, але вже через рік колгосп закупив 10 овець, почалося їх розведення.\n" +
                    "І, мабуть, сама по собі назріла необхідність будівництва майстерні МТС, бо люди ремонтували техніку під одним дахом (стін не було), він тримався лише на стовпах, а це означає, що доводилось працювати на холоді. У 1937 році сіяли багаторічні трави - суданку, люцерну.\n" +
                    "В Держплан здавали зерно, м'ясо, молоко, вовну. Зерно возили до заготівельних пунктів в Апостолове, Радушну, Миколо-Козельськ, Кривий Ріг. На план працювали всі, починаючи рільничою та машинно-тракторною бригадами, молочною фермою, і кінчаючи теслярами, ковалями, сторожами та іншими жителями села.\n" +
                    "В історії Широківщини ніде не згадується політична подія, що відбувалася в 1939 році, коли проводилась мобілізація до лав Червоної Армії. Тоді було організовано пропагандистський похід (чи поїздку) у Західні області України з участю 17 жителів села Пологи.\n" +
                    "15 пологівців було взято на фінську війну (1939-1940 pp.), двоє отримали поранення. На фронтах Великої Вітчизняної війни воювало 70 чоловік, половина з них загинула. А два підлітки загинули вдома від вибуху артилерійського снаряду, який намагалися розрядити.\n" +
                    "У перші роки після визволення село знову стало від-роджуватись. Основною робочою силою були жінки, діти та корівки, які чудом уціліли.\n" +
                    "За 10 післявоєнних років було побудовано 3 ферми для великої рогатої худоби, 2 свинарники, пташник, дитячі ясла, гараж, контору, дорогу з твердим покриттям до Широкого через Водяне і Кравці.\n" +
                    "У 1957 році пологівський колгосп об'єднався з колгоспами «Третій вирішальний» та ім. Ворошилова і став називатись «40 років Жовтня» з правлінням у селі Водяне.\n" +
                    "Пологівські сім'ї рясніли дітьми - по шестеро, семеро. Таких сімей налічувалось 12. У родині Демиденків усі діти були музикантами, а в родині першого тракториста Ф.М. Мірошниченка троє закінчили сільськогосподарський інститут. Відзначилась сім'я Ільченків: Марія Василівна народила 10 дітей. До 1941 року вона, як багатодітна, одержувала по 2 тисячі карбованців на рік. \n" +
                    "У Пологах були й довгожителі - Хима Голобородько всього два роки недожила до ста літ. А Наталії Матвіївні Руденко, яка ^ народилася у 1905 році, ось-ось виповниться 90 (1996\n" +
                    "Серед ділових жінок села виділялась Ганна Іванівна Ільченко, у 1986 році вона виявилась кращою серед приймальниць молока, і Президія Верховної Ради України нагородила її Почесною грамотою.\n" +
                    "Якщо ж торкнутися проблем села, то найпершою була і залишається проблема питної води. Води багато, а питної мало. На все село лише три колодязі з доброю водою. Виручав стародавній колодязь, який знаходився на толоці за два кілометри від села. В 1902 році на нього натрапили будівельники залізниці (залишки якої і зараз знаходяться на 1 км від села).\n" +
                    "Залізничники цей колодязь відремонтували і служить він людям до цих часів. Колодязь добротний, глибиною до 5 метрів, і вода в ньому не вибирається. Але ж далекувато. Воду з колодязя набирали двовідерною баддею, наливали в діжки (5-Ю відер) і візком доставляли до села.\n" +
                    "Оскільки дорослі працювали в колгоспі, то обов'язок постачання води лежав на дітях. Вони й зі ставковою водою були зв'язані. Як же дітлахам без купання? То нічого, що ставки розташовані ген-ген за селом. Самий близький, що біля села Крива Балка, або в селах Сергіївні та Андріївці. А найближче були різні калюжі, від брудної води у дітей на ногах все літо не гоїлись «курчата» (тріщини).\n" +
                    "А той колодязь, що починали копати в голодний рік, а закінчили в 1934 році, так води і не дав. Притік води малий, а вода гірко-солона. А хотіли овочі поливати. Проте не зупинилися тоді на невдачі. В 1935 році придумали, як забезпечити себе овочами. Взялися вирощувати їх на «левадах» біля річки в Широкому (напроти пивзаводу). Роботи було багато, незручно. Парники з розсадою для городів знаходились в Пологах, а городня ділянка в Широкому. Доводилось працівникам городньої бригади жити в гуртожитках, а на городі була побудована землянка, городником був широківський болгарин Георгієв. Овочі возили здавати в заготконтору станції Миколо-Козельськ. Доставляли і в село для потреб населення.\n" +
                    "Проблема «великої води» так до цих пір не вирішена. Хоча з появою дніпровської води стала діяти зрошувальна система з шістьма агрегатами «Кубань». Уже є й газ, дорога з твердим покриттям, а дніпровську воду в селі чекають. До Степової сільради село віднесено в 1965 році, а до цього підпорядковувалось Олександрівській сільській раді.\n" +
                    "А з того часу, як у державному масштабі було взято курс на впровадження економічного реформування, радгоспові «40 років Жовтня» почало не вистачати робочих рук. Господарство потрапило у ряди відстаючих, збиткових. Щоб поправити становище, було вирішено передати його у власність Міністерства внутрішніх справ. Тепер господарство перейменовано. Воно має прозаїчну назву «Сільгоспустанова». Правління його знаходиться в селі Водяне.\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.692647;    val longlatitudeUpLeft =33.463709
        val latitudeDownLeft =47.680704;  val longlatitudeDownLeft =33.473829
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkNewLife(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Нове Життя",
            R.drawable.achivement_villege,
            R.drawable.villege_newlife,
            "Село Нове Життя, або Солдатське\n" +
                    "Назва Солдатське пов'язана з тим, що виникло село при царському режимі на землях, виділених солдатам, які відслужили 25 років військової повинності. По закону військову повинність відбували, тоді тільки селяни та міщани. Тим, які належали до іншого стану, служити було не обов'язково, крім того, хто не бажав служити (і в кого були гроші) мав право найняти замість себе добровольця.\n" +
                    "В 1874 році 25 річний строк служби було відмінено, встановлено новий порядок відбування військової повинності. Кожен новобранець виймав жеребок, по якому він мав служити, або ж звільнявся від служби. Строк служби був 6 років, освіта скорочувала і цей термін: «хто більше вчився, той менше служив».\n" +
                    "Так що цар Олександр II звільнив селян не лише від кріпацтва, а й від 25-річної військової повинності, а тих, хто відбув її, нагородили землею - так і виникло село Солдатське. Нині відомі нащадки тих солдатів не лише в Солдатському, а є вони і в Широкому, і на Криворіжжі (до них відносяться потомки Малофєєвих). Зараз в селі 47 дворів, населення 59 чоловік. А те, що Солдатське перейменоване за радянських часів в Нове Життя всім зрозуміло: життя то нове настало, гірше чи ліпше, але ж нове.\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.755989;    val longlatitudeUpLeft =33.547226
        val latitudeDownLeft =47.733941;  val longlatitudeDownLeft =33.564821
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkOlecsandrivka(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Олександрівка",
            R.drawable.achivement_villege,
            R.drawable.villege_olecsandrivka,
            "Розташована за 25 км на північний схід від райцентру та за 4 км від залізничної станції Радушне Придніпровської залізниці.\n" +
                    "Слобода Олександрівка заснована в 1884 p., деякий час за царського режиму вона називалася Ново-Олександрівка. Одначе на карті 1903 року іменується «поселок Александровский», люди ж називали просто Олександровка.\n" +
                    "По документу за 1908 рік можна уточнити по штампу та печатці назву. Приведемо текст цього документа повністю, бо він проливає світло і на інший бік історії і життя олександрівців.\n" +
                    "На документі в лівому кутку відтиснутий штамп: «МВД. Александровское сельское 4 управление Широкоеской волости Херсонского уезда 2-го стана № 189». Текст документа написаний від руки чорнилом брунатного кольору: \"В Широковское Волостное Правление. Рапорт. Сельское Управление честь имеет донести Широковскому Волостному Правлению, что на видачу годового паспорта крестьянину поселка Олександровка Кузьме Платоновичу Столяру 17 лет, со сторони его родителей и Сельского Управления препятствий не имеется. Александровский сельский на старосту кандидат Федор Понура, писарь Петрович».\n" +
                    "Прикладено круглу печатку. На фіолетовому фоні печатки напис: «Печать сельстарости поселка Александровского Широкоеской волости Херсонской губернии и уезда». Цікавий документ, в ньому навіть прізвища цікаві.\t\n" +
                    "Радянську владу в селі Олександрівка, як і повсюди, було встановлено 1918 році. В 1927 році створено СОЗ (спільна обробка землі). Першими його членами були П.М. Кухтін, К.О. Жаботенко, К.В. Береза, П.П. Смушко. В  1930 році організували два колгоспи «Труд бідняка» (голова   Григорій  Юхимович Березовський) та «Незаможник» (голова  Прокіп Михайлович Кухтін).\t\n" +
                    "В другій половині двадцятих років було організовано лікнеп (лік -  ліквідація, неп - неписьменності) і в 1927 році відкрили трудову школу директором якої була Марія Захарівна Тарута.\t\n" +
                    "З 1952 року почалося укрупнення колгоспу ім. Калініна. Колгосп за високі показники в рільництві і тваринництві кілька разів був учасником ВДНГ;\t (Виставки досягнень народного господарства) СРСР, нагороджувався\n" +
                    "урядовими і міністерськими прапорами, Почесними грамотами Верховної Ради УРСР.\n" +
                    "В колгоспі ім. Калініна багато орденоносців. Серед них В.І. Юрінов, Кухтін, Р.К. Білоус, Н.О. Тимченко. В лікарні довго працював відомий у районі лікар О.П. Бородін, нагороджений орденом Леніна.\n" +
                    "Село Олександрівка одне з найблагоустроєніших на Широківщині, повністю електрифіковане. За рахунок колгоспу збудовано Будинок культури із залом для глядачів на 450 місць, середню школу, універмаг, олійницю.\n" +
                    "В 1987 році за кошти колгоспу збудовано сучасний дитячий комбінат, баню, кілька будинків, водогін, газопровід, молокопункт, навіть ларьок у Кривому Розі, щоб торгувати там власною продукцією.\n" +
                    "Якщо в 1983 році господарство мало найвищу продуктивність корів у районі, то в 1987 році - найвищу врожайність зернових, ставши колгоспом-мільионером. Навіть в 1993 році, коли сільське господарство України опинилось в критичному стані, на полях колгоспу можна було побачити кукурудзу, що стояла, наче ліс. Та хіба\n" +
                    "тільки кукурудза! А які посіви поживного соняшнику, а які кормові буряки! Значить, зрошення - то велика сила. Калінінці зернову силосну кукурудзу вирощують на полях-супутниках. Самі проклали трубопровід на багарні площі, щоб за будь-яких погодних умов бути з хлібом і з кормами.\n" +
                    "Тут варто лише доповнити, хто очолив господарство і зробив його мільйонером. Це голова колгоспу В.А. Алімов, колишній колгоспний коваль. Він користується повагою і славою.\n" +
                    "Але не все так ладно в колгоспі, як ми описали. Калінінців сад підвів. Захопилися зерновими культурами, а за сад забули, і став  він збитковим, а його 68 га було. Що ж, і цього з історії не викинути. Можливо, в нових умовах господарювання і сад даватиме прибуток. Ще дещо з недоліків. В 1991 році молодь села стала скаржитись, що Будинок культури у вихідні дні не працює,\n" +
                    "бо культпрацівникам вигідніше бути весільними музикантами. Добре, якщо в кого є мотоцикл, той може мотнутися на дискотеку в село Водяне чи Рози Люксембург. Іншим доводилося лише скаржитися. А мотоцикли там повинні бути. Статистика за 1987 рік свідчить, що в особистому користуванні було понад 200 мотоциклів і 124 легкових машин.\n" +
                    "На території сільської ради (1997 р.) налічується 607 дворів, населення складає 1559 чоловік. Загальна площа землі 3627 гектарів.\n" +
                    "Голова сільської ради Золотарьов Анатолій Миколайович - молодий, діяльний, цілеспрямований чоловік. Всі свої сили і енергію віддає для жителів своєї сільської ради, покращення їх соціального стану. Велика увага приділяється благоустрою села.\n" +
                    "Село Олександрівка перше з сіл району було газифіковано. Воно вважається одним з найбагатших сіл району. Велику частку свого життя для процвітання колгоспу і села віддав його колишній голова правління Алімов Василь Афанасійович, очолював колгосп більше 25 років. За свої заслуги відзначений званням «Заслужений працівник сільського господарства».\n" +
                    "В 1996 році головою правління КСП «Олександрівське» було обрано Кондратенко Надію Миколаївну. Вона поки що єдина жінка - голова КСП в районі, молода, діяльна, працює над покращенням добробуту населення. В господарстві працює 385 чоловік. Зрошувальних земель 798 гектарів.\n" +
                    "В 1996 році в господарстві вироблено: молока 268 тонн, м'яса- 155 тонн, зерна 1333 тонни, соняшнику 503 тонни. Господарство спеціалізується на вирощуванні зернових культур і виробництві молока.\n" +
                    "КСП одне з найперших відкрило допоміжні промисли, а саме олійницю, млин, миловарню. Відкриті цехи по виготовленню фарби та оліфи. За 1996 рік виготовлено оліфи 97,6 тонни, фарби 26,3 тонни.\n" +
                    "На центральній площі села споруджено меморіальний комплекс загиблим воїнам. Імена 359 воїнів, що загинули при визволенні навколишніх сіл та воїнів-земляків, викарбувані на стелах\n" +
                    "(Джерело: Широківщина В.Ганенко, Л.Бай)"
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.741380;    val longlatitudeUpLeft =33.512096
        val latitudeDownLeft =47.724235;  val longlatitudeDownLeft =33.548389
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkPodove(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Подове",
            R.drawable.achivement_villege,
            R.drawable.villege_podove,
            "Засноване в 1910 році. Знаходиться за 18 км. від Широкого та за 3 км від Олександрівни. Утворилося воно внаслідок земельної реформи, законодавцем якої був П.Столипін. На нове поселення вийшло 35 сімей. Це були працьовиті господарі, що любили землю.\n" +
                    "Для кожної садиби виділялась одна десятина землі, на території якої будувалися хата, клуня, тік. На ньому зберігалося збіжжя з поля, солома, полова, сіно, реманент. На решті землі садили плодові дерева, ягідники. Власники садиб працювали багато і важко.\n" +
                    "За селом з півночі був одруб № 2. Він складався з семи садиб. На сході села були розташовані хутори Карпця та братів Машинспьких. Перед селом з південної сторони далі на схід стояв вітряк (млин). Село виглядало, ніби намальоване. Хати стояли в садках. Вулиці зелені, порослі споришем, а посередині - шлях (дорога).\n" +
                    "Погано лише те, що в селі не було питної води. Возили її з колодязя, який знаходився за 2 км південніше хутора Шутівського. Він був широким, глибина досягала 10 метрів. Викопали його десь у 1900 році. Це тоді, коли ялову худобу випасали влітку заможні широчани. Колодязь існує і понині(20І2р.)\n" +
                    "Село Подове разом з селами Кряжове і Новий Сад стали бригадою № 2 колгоспу ім. Ворошилова, а пізніше - «40 - річчя Жовтня».\n" +
                    "Люди були працьовиті, вміли обробляти землю. Працювали під гаслом «Не зробив норму - не йди з поля!». Тут працював Гардаш Терешко Григорович, людина розумна і освічена. Він добре розумівся в агротехніці, був здібним організатором. Бригадиром механізаторі був Муха Дмитро Дем'янович. Він\n" +
                    "учасник Всесоюзної сільськогосподарської виставки в Москві, нагороджений медаллю, премійований мотоциклом. Учасником Всесоюзної сільськогосподарської виставки в Москві була і свинарка Максименко Надія Василівна. Знали ціну землі і добре працювали на ній Целік Гаврило Іванович -бригадир польової бригади, Павленко Семен Онисімович - різноробочий.\n" +
                    "Голодомор 1932 - 33 років пережили дуже важко. В 1933 році привезли в село худих, бідно одягнених дітей з дитячого будинку. їх раніше підібрали на вулицях міст і сіл. Вони жили у жителів села. Вчилися у Подівській початковій школі, а потім в Олександрівській 8-річній. Одна з них - Дудниченко Дуня -вивчилася на трактористку. Після закінчення навчання дівчата працювали в колгоспі.\n" +
                    "Вчителями школи 1930-1933 років були Лялькова Зінаїда Василівна, Дрібошевський, Пархоменко Павло Іванович, Кваша Микола Васильович. В селі в 1923 році збудована початкова школа з двома світлими класами та з квартирою для вчителя. В ній навчалися діти 1 - 4 класів з трьох сіл: Подове, Кряжове, Новий Сад. Школа вигляділа величною, світлою, була обсаджена садом. Біля неї розбиті майданчики для ігор. Багато агрономів, учителів, медпрацівників, інженерів починали навчання в Подівській початковій школі. Так на першій атомній станції в м. Обнінську Калузької області працював старший науковий працівник Попов Павло Михайлович, уродженець села Подове. Навчався в Подівській початковій школі. А Тетеровська Тетяна Дем'янівна тут вчилася і після закінчення працювала вчителем початкових класів з 1944 по 1976 рік. За успіхи в роботі з молодим поколінням нагороджена значком «Відмінник народної освіти». Гардаш Семен Терентійович - корінний житель Подового - став вчителем математики, працював у нашому районі аж до виходу на пенсію.\n" +
                    "Подальша доля села Подове така, як і усіх сіл, що входили до колгоспу «40 -річчя Жовтня». Зараз воно відноситься до Широківського виправного центру № 75. Поступово майже всі жителі села переїхали жити в ближні села, а хати та городи використовують, в основному, дачники.\n"+
                    "(Джерело: матеріали біблеотекаря Водянської біблеотеки Антоніни Самчик)"
            )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.744496;    val longlatitudeUpLeft =33.487929
        val latitudeDownLeft =47.734106;  val longlatitudeDownLeft =33.496941
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkKrazove(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Кряжове",
            R.drawable.achivement_villege,
            R.drawable.villege_krazove,
            "Село Кряжове знаходиться на відстані 1,5 км від сіл Красний Під, Водяне та Подове. Навколо села багато іригаційних каналів. Поруч проходить автомобільна дорога Т 0411. \n"+
                    "Село Кряжове засноване вихідцями із Широкого. Розташоване на деякій підвищенності, тобто знаходиться на кряжу, тому й назвали Кряжове. В період танення снігу водою не затоплюється.\n" +
                    "Спочатку переселилося 26 дворів. Перші поселенці Калюга Тиміш Данилович, Сулімовський Семен Ілліч, Борисенко Юхим, Сидоренко Онопрій Корнійович, Сидоренко Корній Романович, Курило Трохим Афанасійович, Тарасенко Оникій Наумович, Сагура Тихін Романович, Карамушка Василь, Тарасенко Василь Леонтійович, Усик Григорій Макарович. Сулімовський Василь Ілліч, Доценко Артем Онуфрійович, Ільченки Петро і Павло, Усик Макар Слисейович, Бугайов Андрій Сергійович. Шишка Омелько Матвійович, Голуб Свирид Михайлович, Борисенко Каленик Васильович, Ведміцький Антон Михайлович, Гура Олександр Петрович, Борисенко Каленик Васильович, Телих Григорій Васильович.\n" +
                    "Хати будували на кам'яному фундаменті, стіни - з «лампачу» (глина з піском та соломою). Такі будинки хоч і були теплі, але боялись зайвої вологості. Так жили і працювали всі. В господарстві не зайві були й дитячі руки. Змалку привчались до роботи. Пасли гусей, телят, доглядали за малими дітьми. І.А.Доценко згадував: « Мені не було ще й семи років, як я поганяв коней у косарці під час жнив. А щоб не випав, мене прив'язували до сидіння. В обід, коли годували коней, моя бабуся клала мене спати у катразі (намет з конопель). Такі катраги ставили на випадок негоди. Бабуся сиділа біля мене і весь час відганяла мух, щоб я хоч трішки відпочив. А під час жнив при сприятливій погоді працювали майже цілодобово. Косили косаркою (жаткою), а вслід жінки в'язали снопи, складали їх у копи. Снопи звозились у двір, де вже був підготовлений тік для обмолоту. Якщо не встигали з обмолотом, то збіжжя складали у клуні, а потім молотили поступово. У кожного господаря біля хати була десятина землі, де розміщались всі потрібні споруди, фрукгові дерева, ягідники».\n" +
                    "НЕП - нова економічна політика - була спрямована на розвиток одноосібного господарювання. У 1921 р. була видана Постанова Уряду про заміну продовольчої розкладки податком .Кожен господар обкладався фіксованим податком, а решта залишалась йому. Таким чином кожен намагався виробити більше, щоб більше мати для своїх потреб. Тож багато трудівників стали заможними. Сагура Тихін відкрив кузню, Шишка Омелян - теслярню. Стали жити добре. Але прийшли важкі часи: настала колективізація.\n" +
                    "Вона почалася в сільському господарстві у 1929 р. Організовувались колгоспи на період посіву та збору врожаю. По закінченні - розходились.\n" +
                    "В 1930 -му вийшла Постанова про суцільну колективізацію. Уповноважені комуністи агітували про вступ до колгоспу, а до тих, хто не згоджувався, застосовували грубі насильницькі методи: відбирали майно, житло, розкуркулювали. Навіть висилали на новобудови Півночі та Сибіру. Так у селі Кряжовому був організований колгосп, головою якого призначили Тарасенка Оксептія Наумовича.\n" +
                    "У 1931 році колгосп організували з трьох сіл: Новий Сад, Кряжове, Подове. Назвали іменем Ворошилова. Головою колгоспу став Ільченко Олексій. Щоб підняти сільське господарство Уряд видав постанову «Про обов'язкову поставку зерна колгоспами і одноосібними господарствами», згідно якого запроваджувався погектарний принцип хлібозаготівлі, який зацікавлював селян в результатах своєї праці. Крім того колгосп почали оснащувати сучасною технікою, придбали вантажного автомобіля ГАЗ-А. Побудували кузню, теслярню. Завели конеферму. Для покращення поголів'я коней на Дону купили жеребця «Норда». Готували коней для армії у фонд РСЧА (Робітничо-Селянської Червоної Армії). Молодь охоче доглядала коней, привчала їх до верхової їзди, хоч сідел на всіх не вистачало. Доводилось і без них підстрибувати на своїх сідницях , скачучи на коні, показувати на вигоні молодецьку вправність на заздрість малечі. 1934 року головою колгоспу став «двадцятип'ятитисячних» Донців Мелентій. Через рік головою обрали Сулімовського Василя Ілліча, який керував колгоспом до війни і до 1951 р. після неї. Саме тоді Кряжове, Новий сад, Подове (колгосп 3-й Вирішальний) Вологе. Водяне об'єднали в колгосп імені Ворошилова. Головою став Афапасьєв Кузьма Микитович з 3-го Вирішального. У 1952-1954 pp. - Луговий, а в 1954-1961 - Малевич Василь Микитович, присланий з району. За його керівництва у 1955р. колгоспи знов об'єдналися. До колгоспу Ворошилова приєдналися «Червоний партизан». Пологи, Озерне, Ворошиловка ( 1). Тихе ( 2 ). І Іазва об'єднаного господарства залишилась\n" +
                    "ім. Ворошилова. А 1957 року на честь відзначення ювілею революції колгосп перейменували на «40-річчя Жовтня».\n" +
                    "Колгоспне життя стало налагоджуватись. Перебудовували старі розкуркулені хати. В Ільченковій відкрили клуб та колгоспну контору. Туди провели телефон. Збудували комору та конюшню. Посадили 10 гектарів саду. У кожному селі була колгоспна бригада, свій бригадир, тяглова сила, сільськогосподарський реманент. \n" +
                    "Багато неписьменних було не тільки в Кряжовому, а й у інших селах. їх навчали читати і писати в лікнепах, де і «вчителями» були такі ж, що самі ледве вміли писати і читати. У свята жінки збиралися у «хату-читальню» Доиенко Тетяни Наумівни. яка вголос читала Кобзаря, або «Про славне військо запорозьке-низове» Кащенка й інші цікаві твори. Читала вона гарно, художньо. хоч жодного дня не навчалася в школі. Вивчилась у сина господаря, в якого 8-річною дівчинкою пасла худобу. Син приходив із школи, біг до Тетянки і вчив з нею уроки. Арифметики Гетянка навчилася там також, та так. що і йому допомагала розв'язувати задачі. Господар лише випадково довідався, що пастушка допомагає синові.\n" +
                    "Селяни жили дружно, допомагали один одному, особливо в догляді за дітьми. Виховували чесність і справедливість, повагу до старших, не допускали вживання поганих слів. Про крадіжки не було й мови. На дверях хат не було замків, а двері зав'язувались мотузкою, щоб видно було, що дома нікого нема. (До речі, це стосується усіх сіл. навіть і такого великого, як Широке). Жителі дотримувались релігійних свят та обрядів. Ці традиції передавали дітям. У неділю привозили кіно, щоправда німе. Для людей це була велика подія. особливо для дітей. Електрики не було, а тому доводилось крутити динамо-машину вручну. За те хлопчаків пропускали в клуб безкоштовно. Влітку кінофільми демонстрували прямо на подвір'ї. В клубі учні брали участь в концертах. Діяла молодіжна комсомольська організація з 40 чол. Парторганізація складалася з 3-х осіб: Сулімовський В.І.,\n" +
                    "С. Ф. Целік, Мороз К. Правління колгоспу не лише дбало про добробут людей та благоустрій села, а вкладало кошти і на прокладання гужових шляхів (Олександрівка - Широке). Дорогу обсадили деревами, призначили доглядача Шишку Явтуха.\n" +
                    "Придбали цілий ряд машин, які полегшували працю колгоспників. Комбайни спочатку були причіпні - «Коммунар» і «Сталіиець». їх тягали одним трактором по 2-3 комбайни сукупно, щоб економити пальне. Працювали трактори ХТЗ та «Універсал». Машинно-тракторна станція (МІС) знаходилась в с. Олександрівні і обслуговувала багато колгоспів. За ремонт техніки колгоспи розплачувались з нею зерном. Якщо комбайни полегшували працю колгоспників, то збір соняшника та кукурудзи залишався громіздким. Доводилось збирати вручну. Виходили в степ і старі, і малі. Погано, що в МТС було достатньо тракторів, але не вистачало причіпного інвентаря. На оранці до одного трактора чіплявся один плуг, котрого підіймав і опускав на поворотах причіплювач, що сидів зверху. Культиваторів теж не вистачало. Під час сівби використовували кінну тягу. А ще иримінявся такий метод сівби, як розсівання зерна вручну. Як тільки земля звільнялася від снігу, в поле виходили чоловіки і розкидали зерно. Але ж сходило воно нерівномірно. Та ще й птахи багато\n" +
                    "викльовували. Доводилось знову виходити в поле розганяти птахів. І це при наявності МТС. А коли сівалок стало вдосталь, то такий метод вже не ириміняли. За сівалкою ходив сівач і регулював, щоб зерно лягало в землю рівномірно. Прополювання соняшника і кукурудзи проводилось невеликою полінкою, за якою йшов, правуючи нею, колгоспник. А ще один працівник вів у міжрядді коня, запряженого у полільник. Якщо цю роботу виконував хлопець, то він сідав верхи на коня. Оранку на зяб проводили в останню чергу. Плуги використовували однолемішні і двохкорпусні з невеликими лемешами. Сіно косили сіножатками, або, як і хліб, косарками. Скошене накидали на гарби вручну вилами. Скидали і скиртували теж вручну. До роботи вставали дуже рано. Робили перерву на обід, щоб дати відпочинок коням і людям. І знов трудилися до заходу сонця. Працювали за трудодні. Заробляли непогано, особливо механізатори від МТС.\n" +
                    "\n(Джерело: матеріали біблеотекаря Водянської біблеотеки Антоніни Самчик)"
            )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.745477;    val longlatitudeUpLeft =33.457631
        val latitudeDownLeft =47.728391;  val longlatitudeDownLeft =33.483122
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkVodane(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Водяне",
            R.drawable.achivement_villege,
            R.drawable.villege_vodane,
            "Село Водяне засноване в 1923 році. Його заселили переселенці з села Широкого. Переселилися добрі господарі, які цінили землю і хотіли на ній працювати. Завзятими господарями були Кисілі, Орисеньки, Півтораки, Орли, Малишки, Устименки, Бобирі, Суховії, Карпці, Васильченки. Кожному дали дві десятини землі. По плану село треба було будувати на одній лінії з селами Новий Сад, Кряжове, Пологи, Озерне. Але на тій місцевості де повинно стояти село була дуже хороша родюча земля і переселенці домовилися із землеупорядником, щоб село побудувати далі на схід, де земля була гірша, часто підходили води. Після побудови село стало заливати весною водою, яка підходила з східної сторони. Ось чому це село назвали Водяне. Свої будинки переселенці обсадили вишнями, яблунями, грушами, шовковицею. \n" +
                    "Спочатку організували колгосп в самому селі. Першим головою колгоспу був Устименко Василь Климович. В 1932 році об'єднали села Водяне, Влажнє в один колгосп «3-ій Вирішальний». Головою колгоспу райком партії призначив Афанасьєва Кузьму Микитовича з сусіднього села Олександрівка, так званого двадцятип'ятитисячним. Працювали непокладаючи рук. Вирощували зернові (пшеницю, ячмінь, овес, жиго), соняшник, буряк, кукурудзу.\n" +
                    "В 1951 колгосп «3-ій Вирішальний» з'єднали з колгоспом ім..Ворошилова (с.Кряжове, с. Подове і с. Новий Сад) в колгосп «ім..Ворошилова». головою колгоспу залишився Афанасьєв К.М. землі стало більше. З появою в сусідньому селі Олександрівка МТС (машинно-тракторної станції) працювати стало легше, так як станція обслуговувала багато колгоспів. За роботу брали натуроплатою - зерном, згідно угоди між керівником МТС і колгоспів. Так, як причіпного інвентаря було мало, то використовували старий. Він був недосконалий. Тому людям було працювати важко. Але все ж таки легше, ніж без тракторів. Було організовано навчання дітей. Навчалися діти в великій кімнаті хати Устименко Овсія. Першим учителем був Батіжок Перто Трохимович. Діти відвідували школу з двох сіл Влажного та Водяного. Пізніше побудували нову кам'яну школу з двома великими світлими класами та з квартирою для вчителя. До війни вивчилися: (с.Водяне) 1 .Масляний Іван - інженер; 2.Шишка Микола Васильович - інженер-авіоконструктор; 3.Шишка Маруся Василіївна - вчителька; 4.Суховій Віра Іванівна- вчителька; 5.Устименко Соня Овсіївна — вчителька після війни.\n" +
                    "До проведення в село електричного струму в 50-му році придбали установку, яка виробляла електрострум (динамомашина з движком трактора «Натік»). Освітлювали будинки колгоспників та тваринницькі ферми. О 23 світло на секунди виключали, попереджуючи, що о 24 годині виключать на ніч. О шостій годині ранку включали. Біля двигуна працювали Борисенко Федір Максимович і Біднов Федір Васильович.\n" +
                    "Електричний струм стали підводити від Каховської ГЕС десь в 50-.ч роках. Спочатку стовпи (опори) були дерев'яні. Була прислана бригада. Бригадир був Кабанов. Сама бригада шкурила стовпи, просмолювала частину стовпа, що буде в землі. Це все вони робили біля конеферми (склад для зерна біля І Іівтора І [аталії Андріївни).\n" +
                    "У 1955 році дерев'яні стовпи замінили на бетонні. Біля кожної хати клали стовп. Господар хати рив яму 1,5м глубиною (з східцями). Провода були мідні квадратні і ізольовані.\n" +
                    "Олійницю зробили в 1939 році. Вона була в с.Влажнє з західної його сторони. В різні роки працювали на ній Голобородько Христофор, Фісюн Зінько, Іщенко Іван Слисейович.\n" +
                    "Вирощували також і овець. Вівці тримали в фермі села Влажнє в 50-х роках. Коли   прийшов  до   влади   Хрущов,   то  МТС   роздало  трактори   по колгоспах  і  у  кожному  стала тракторна  бригада,  а МТС  стала  РТС  - ремонтно-тракторна   станція.   Вона   ремонтувала   трактори   колгоспів.   У Водяному тракторна бригада зразу була там під 13 насосною (де шовковиця).\n" +
                    "В 50-60 роках вирощували шовкопряди. Бригадиром бригади була Суха Марія. В колгоспі спеціально насадили шовковицю в двох місцях. Під селом Першим і на північному заході за Водяном. Це давало хороші доходи.\n" +
                    "Так як хати колгоспників були під соломою, то стали перекривати їх. У 1957-58 роках возили з Лоза ватки черепицю для перекриття будинків колгоспників та покриття ферм. Черепицю давали другого copy, але вона і до цього часу дуже хороша (2006р).\n" +
                    "У західної сторони села Водяне було велике озеро. Під його краєм з заходу глибина була до двох метрів. З південної сторони теж було озеро (під Влажним), але не таке глибоке. Взагалі води було кругом багато. Вулиця села залита водою. На всю вулицю було 3-4 переходи з однієї сторони на другу. На початку села з заходу, біля школи і два переходи на тому краю села з східної сторони. Зимою вода замерзала і це було роздолля для дітей. Ставали на коньки на порозі хати і увесь час ковзали. Грали в гру «Свинка». Ціль (концервну банку, або ще щось) били палками, забирали один в одного. Так ганяли до схочу. Змагалися по переплигуванні перешкод. Перешкодами були куфайки, в які діти були одіті. їх клали через деякі проміжки на льоду. Клали куфайки вподовж, впоперек, дві вподовж або дві впоперек. Ясно, що якщо не переплигнеш, то обов'язково впадеш, бо ж куфайка затормозе коньки. І так ганяли по всьому озері. Увечері виходили на південне озеро і дівчата. Тоді усі разом грали в різні ігри. Коньки були різні; металеві, дерев'яні, високі, низькі. Але самі кращі це металеві.\n" +
                    "Визволяли село радянські війська в лютому 1944 році. Вони ішли із сторони Апостолово. Боїв у селі не було. Наші війська гнали ворога -швидко. Німці забрали ковбаси, обладнання пекарні і втікли. Але в Інгульці вони пішли в контрнаступ і наші війська відійшли назад аж за Степне. Тому відступаючі були і в нашому селі. Ранених розмістили в велику класі школи. Мертвих хоронили - прямо в селі. За городом у Іваник Ніни була братська могила. На місці побудованої в 1996 році школи в одній могилі похоронили десь 50 воїнів. У Перепилиці Георгія в городі під грушею захорог солдата. На кладовищі теж була могила, бо батько Устименка М.О. Овсій Сидорович з Доцентом Пилипом хоронили декілька солдат. Пізніше в 50-х роках останки перехоронили в братську могилу села Олександрівка.\n" +
                    "Щоб погнати німців наші встановили дві ракетні установки системи «Град» так звані «Катюші». Одну на півдні села біля кладовища а другу з північної сторони. їх маскували під землею у спеціально виритих схронах. Вистрілить і в схрон, щоб не засік противник де вона стоїть. Стріляла тільки одна, що була в городах біля кладовища. 8 залпів по 4 снаряди. Це була допомога піхоті. Німців погнали. Більше вони не вернулися.\n" +
                    "\n (Джерело: матеріали біблеотекаря Водянської біблеотеки Антоніни Самчик)"
            )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.721168;    val longlatitudeUpLeft =33.472741
        val latitudeDownLeft =47.708727;  val longlatitudeDownLeft =33.493648
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkOzerne(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Озерне",
            R.drawable.achivement_villege,
            R.drawable.villege_ozerne,
            "Село Озерне знаходиться на відстані 2 км від сіл Пологи і Кравці."
            )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.674215;    val longlatitudeUpLeft =33.446681
        val latitudeDownLeft =47.654853;  val longlatitudeDownLeft =33.463842
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkKalunivka(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Калинівка",
            R.drawable.achivement_villege,
            R.drawable.villege_kalunnivka,
            "Село Калинівка знаходиться на відстані 1,5 км від сіл Гречані Поди і Трудолюбівка. Поруч проходить автомобільна дорога Н23."
        )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.786735;    val longlatitudeUpLeft =33.490346
        val latitudeDownLeft =47.779499;  val longlatitudeDownLeft =33.508627
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }
    fun checkTrud(locationtemp: Location):List<Achievement>
    {
        val info =Achievement(
            null,
            "Трудолюбівка",
            R.drawable.achivement_villege,
            R.drawable.villege_trud,
            "Село Трудолюбівка знаходиться за 1,5 км від села Калинівка та за 2,5 км від сіл Красний Під і Подове. На відстані 2,5 км проходить канал Дніпро - Кривий Ріг.\n"+
                    "Село Трудолюбівка раніше називалося Лекерт і входило в Сталіндорфський єврейський національний район. "
            )

        val listAchievement: MutableList<Achievement> = mutableListOf()
        val latitudeUpLeft =47.768267;    val longlatitudeUpLeft =33.491848
        val latitudeDownLeft =47.762430;  val longlatitudeDownLeft =33.525144
        if (locationtemp.latitude<latitudeUpLeft/*верхний левый*/){
            if (locationtemp.latitude>latitudeDownLeft/*нижний правый*/){
                if (locationtemp.longitude>longlatitudeUpLeft/*верхний левый*/){
                    if (locationtemp.longitude<longlatitudeDownLeft/*нижний левый*/){
                        return listOf(info)
                    }
                }
            }
        }

        return listAchievement.toList()
    }

}